FILES/InformationRegisters/НастройкиСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>НастройкиСистемы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НаборХарактеристикСистемный</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НаборХарактеристикСистемный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FILES/InformationRegisters/НастройкиСистемы/Ext/ManagerModule.bsl
Функция ЗагрузитьПредопределенныеЗначения() Экспорт
	
	Макет = РегистрыСведений.НастройкиСистемы.ПолучитьМакет("ПредопределенныеЗначения");
	
	ТекущаяСтрока = 1;
	ВыполнятьЗагрузку = Истина;
	Пока ВыполнятьЗагрузку Цикл
		ТекущаяСтрока = ТекущаяСтрока + 1;
		
		Характеристика	 = Макет.Область(ТекущаяСтрока, 1, ТекущаяСтрока, 1).Текст;
		Значение		 = Макет.Область(ТекущаяСтрока, 2, ТекущаяСтрока, 2).Текст;
		   
		Если Характеристика = "" Тогда
			ВыполнятьЗагрузку = Ложь;
		Иначе
			Попытка
				НоменклатураБТ = Справочники.НоменклатураБТ.ПолучитьСсылку(Новый УникальныйИдентификатор(Значение));
				Если НЕ (НоменклатураБТ.ПолучитьОбъект() = Неопределено) Тогда
					МЗ = РегистрыСведений.НастройкиСистемы.СоздатьМенеджерЗаписи();
					МЗ.Характеристика = ПланыВидовХарактеристик.НаборХарактеристикСистемный[Характеристика];
					МЗ.Значение = НоменклатураБТ;
					МЗ.Записать(Истина);
				КонецЕсли;
			Исключение
			КонецПопытки;
		КонецЕсли;
			
	КонецЦикла;
	
КонецФункции
